package com.urise.webapp;

import java.util.Random;

public class NamesGenerator {
    private static final String[] names = {"Иванов Александр", "Смирнова Мария", "Кузнецов Дмитрий", "Попова Анна", "Васильев Михаил", "Петрова Екатерина", "Соколов Иван", "Михайлова Ольга", "Новиков Сергей", "Федорова Наталья", "Морозов Андрей", "Волкова Елена", "Алексеев Павел", "Лебедева Татьяна", "Семенов Алексей", "Егорова Ирина", "Павлов Николай", "Козлова Светлана", "Голубев Владимир", "Виноградова Юлия", "Кириллов Артем", "Орлова Анастасия", "Макаров Виктор", "Захарова Оксана", "Зайцев Константин", "Романова Ксения", "Тимофеев Роман", "Фомина Вероника", "Богданов Евгений", "Власова Ангелина", "Савельев Григорий", "Никитина Алёна", "Григорьев Станислав", "Цветкова Валерия", "Рыбаков Даниил", "Данилова Полина", "Маслов Никита", "Жукова Дарья", "Тарасов Игорь", "Белова Василиса", "Белов Тимур", "Кудрявцева Ульяна", "Баранов Святослав", "Архипова Виктория", "Филиппов Вадим", "Степанова Марина", "Комаров Юрий", "Борисова Людмила", "Дмитриев Антон", "Маркова Галина", "Ефимов Георгий", "Горбунова Злата", "Щербаков Фёдор", "Антипова Лидия", "Поляков Максим", "Титова Валентина", "Карпов Руслан", "Медведева Эльвира", "Шестаков Платон", "Калинина Инна", "Осипов Всеволод", "Назарова Раиса", "Матвеев Марк", "Силина Кира", "Вишняков Валерий", "Самсонова Регина", "Герасимов Семён", "Логинова Эмилия", "Трофимов Арсений", "Зимина Лилия", "Ушаков Денис", "Крылова Арина", "Денисов Лев", "Терентьева Алла", "Жуков Ян", "Комарова Нелли", "Воробьев Эдуард", "Носкова Римма", "Лазарев Илья", "Турова Клавдия", "Ершов Тимофей", "Клименко Софья", "Тихонов Петр", "Федосеева Снежана", "Афанасьев Мирон", "Молчанова Изольда", "Власов Матвей", "Игнатьева Вероника", "Давыдов Леонид", "Кузьмина Тамара", "Гусев Захар", "Королева Жанна", "Наумов Олег", "Евдокимова Нонна", "Ширяев Мирослав", "Родионова Эвелина", "Силин Гордей", "Суханова Диана", "Михеев Борис", "Зыкова Лариса"};

    public static String getName(int num) {
        return switch (num) {
            case 1 -> "Quentin Quinn";
            case 2 -> "Aaron Adams";
            case 3 -> "Kevin Knight";
            default -> {
                Random rnd = new Random();
                yield names[rnd.nextInt(100)];
            }
        };
    }
}
